import { Effect, Logger } from "effect"

import { VectorService } from "../vector"
import { NewQAWorkflow } from "./new-qa"

const q1 = `เมื่อประเทศก้าวสู่สังคมสูงวัย แรงงานหดตัว อุตสาหกรรมใหม่ๆ ไม่เกิด หากพรรคประชาชนได้รับความไว้วางใจให้เป็นรัฐบาลประชาชน เราพร้อมผลักดันนโยบายสร้างงานและอุตสาหกรรมใหม่ แก้ปัญหาคนสูงวัยไปพร้อมกัน ดังนี้
.
สร้างงานใหม่ด้วยการลงทุนระบบสาธารณสุข ให้มีผู้ดูแลผู้ติดบ้านติดเตียง อสม. หรือ ลูกหลานที่ผ่านการอบรมดูแลพ่อเฒ่าแม่แก่ที่ติดบ้าน ติดเตียง ทำงานเต็มเวลา จะมีรายได้ถึงเดือนละ 15,000 บาท เพื่อลดภาระลูกหลาน สร้างรายได้ให้กับครอบครัว สร้างอาชีพ พร้อมพัฒนาอุตสาหกรรมใหม่ด้านการแพทย์ในไทยเพิ่ม เช่น ระบบ Telemedicine
.
อสม. หรือลูกหลานที่ผ่านการอบรมดูแลผู้สูงอายุ ไปตรวจระดับน้ำตาลในเลือด ไปวัดความดัน สามารถใช้อุปกรณ์ที่ถือไปได้และตรวจหน้าบ้าน ตรวจเสร็จส่งข้อมูลออนไลน์กลับมาที่ศูนย์อนามัย กลับมาที่โรงพยาบาล สามารถพบคุณหมอออนไลน์ได้เลย
.
ณัฐพงษ์ เรืองปัญญาวุฒิ แคนดิเดตนายกรัฐมนตรี พรรคประชาชน
.
จากรายการเรื่องใหญ่ รายวัน “เปิดที่แรก! ไม้ตายส้ม เขย่าเลือกตั้ง ฝ่าวิบากกรรม” วันที่ 6 มกราคม 2569`

async function main() {
  console.log("start")
  await Effect.gen(function* () {
    const workflow = yield* NewQAWorkflow

    return yield* workflow.addQAWorkflow({
      source: "facebook",
      speaker: "ณัฐพงษ์ เรืองปัญญาวุฒิ",
      text: q1,
      url: "https://www.facebook.com/events/1234567890/",
    })
  }).pipe(
    Effect.provide(NewQAWorkflow.Default),
    Effect.provide(Logger.structured),
    Effect.provide(VectorService.Default),
    Effect.runPromise,
  )
}

await main().then(() => process.exit(0))
